RT-Thread/rt-thread/bsp/at32/libraries/AT32F435_437_Firmware_Library/drivers/inc/at32f435_437_xmc.h
} xmc_bank1_tmgwr_reg_type;

/**
  * @brief xmc bank1 registers
  */
typedef struct
{
  /**
    * @brief xmc bank1 ctrl and tmg register, offset:0x00~0x1C
    */
  xmc_bank1_ctrl_tmg_reg_type ctrl_tmg_group[4];

  /**
    * @brief xmc bank1 reserved register, offset:0x20~0x100
    */
  __IO uint32_t reserved1[57];

 /**
    * @brief xmc bank1 tmgwr register, offset:0x104~0x11C
    */
  xmc_bank1_tmgwr_reg_type tmgwr_group[4];

  /**
    * @brief xmc bank1 reserved register, offset:0x120~0x21C
    */
  __IO uint32_t reserved2[63];

  /**
    * @brief xmc bank1 ext register, offset:0x220~0x22C
    */
  union
  {
    __IO uint32_t ext[4];
    struct
    {
      __IO uint32_t buslatw2w            : 8; /* [7:0] */
      __IO uint32_t buslatr2r            : 8; /* [15:8] */
      __IO uint32_t reserved1            : 16;/* [31:16] */
    } ext_bit[4];
  };

} xmc_bank1_type;

/**
  * @brief xmc bank2 registers
  */
typedef struct
{
  /**
    * @brief xmc bk2ctrl register, offset:0x60
    */
  union
  {
    __IO uint32_t bk2ctrl;
    struct
    {
      __IO uint32_t reserved1            : 1; /* [0] */
      __IO uint32_t nwen                 : 1; /* [1] */
      __IO uint32_t en                   : 1; /* [2] */
      __IO uint32_t dev                  : 1; /* [3] */
      __IO uint32_t extmdbw              : 2; /* [5:4] */
      __IO uint32_t eccen                : 1; /* [6] */
      __IO uint32_t reserved2            : 2; /* [8:7] */
      __IO uint32_t tcr                  : 4; /* [12:9] */
      __IO uint32_t tar                  : 4; /* [16:13] */
      __IO uint32_t eccpgs               : 3; /* [19:17] */
      __IO uint32_t reserved3            : 12;/* [31:20] */
    } bk2ctrl_bit;
  };

  /**
    * @brief xmc bk2is register, offset:0x64
    */
  union
  {
    __IO uint32_t bk2is;
    struct
    {
      __IO uint32_t res                  : 1; /* [0] */
      __IO uint32_t hls                  : 1; /* [1] */
      __IO uint32_t fes                  : 1; /* [2] */
      __IO uint32_t reien                : 1; /* [3] */
      __IO uint32_t hlien                : 1; /* [4] */
      __IO uint32_t feien                : 1; /* [5] */
      __IO uint32_t fifoe                : 1; /* [6] */
      __IO uint32_t reserved1            : 25;/* [31:7] */
    } bk2is_bit;
  };

  /**
  * @brief xmc bk2tmgmem register, offset:0x68
  */
  union
  {
    __IO uint32_t bk2tmgmem;
    struct
    {
      __IO uint32_t cmst                 : 8; /* [7:0] */
      __IO uint32_t cmwt                 : 8; /* [15:8] */
      __IO uint32_t cmht                 : 8; /* [23:16] */
      __IO uint32_t cmdhizt              : 8; /* [31:24] */
    } bk2tmgmem_bit;
  };

  /**
  * @brief xmc bk2tmgatt register, offset:0x6C
  */
  union
  {
    __IO uint32_t bk2tmgatt;
    struct
    {
      __IO uint32_t amst                 : 8; /* [7:0] */
      __IO uint32_t amwt                 : 8; /* [15:8] */
      __IO uint32_t amht                 : 8; /* [23:16] */
      __IO uint32_t amdhizt              : 8; /* [31:24] */
    } bk2tmgatt_bit;
  };

  /**
  * @brief xmc reserved register, offset:0x70
  */
  __IO uint32_t reserved1;

  /**
  * @brief xmc bk2ecc register, offset:0x74
  */
  union
  {
    __IO uint32_t bk2ecc;
    struct
    {
      __IO uint32_t ecc                  : 32; /* [31:0] */
    } bk2ecc_bit;
  };

} xmc_bank2_type;

/**
  * @brief xmc bank3 registers
  */
typedef struct
{
  /**
    * @brief xmc bk3ctrl register, offset:0x80
    */
  union
  {
    __IO uint32_t bk3ctrl;
    struct
    {
      __IO uint32_t reserved1            : 1; /* [0] */
      __IO uint32_t nwen                 : 1; /* [1] */
      __IO uint32_t en                   : 1; /* [2] */
      __IO uint32_t dev                  : 1; /* [3] */
      __IO uint32_t extmdbw              : 2; /* [5:4] */
      __IO uint32_t eccen                : 1; /* [6] */
      __IO uint32_t reserved2            : 2; /* [8:7] */
      __IO uint32_t tcr                  : 4; /* [12:9] */
      __IO uint32_t tar                  : 4; /* [16:13] */
      __IO uint32_t eccpgs               : 3; /* [19:17] */
      __IO uint32_t reserved3            : 12;/* [31:20] */
    } bk3ctrl_bit;
  };

  /**
    * @brief xmc bk3is register, offset:0x84
    */
  union
  {
    __IO uint32_t bk3is;
    struct
    {
      __IO uint32_t res                  : 1; /* [0] */
      __IO uint32_t hls                  : 1; /* [1] */
      __IO uint32_t fes                  : 1; /* [2] */
      __IO uint32_t reien                : 1; /* [3] */
      __IO uint32_t hlien                : 1; /* [4] */
      __IO uint32_t feien                : 1; /* [5] */
      __IO uint32_t fifoe                : 1; /* [6] */
      __IO uint32_t reserved1            : 25;/* [31:7] */
    } bk3is_bit;
  };

  /**
  * @brief xmc bk3tmgmem register, offset:0x88
  */
  union
  {
    __IO uint32_t bk3tmgmem;
    struct
    {
      __IO uint32_t cmst                 : 8; /* [7:0] */
      __IO uint32_t cmwt                 : 8; /* [15:8] */
      __IO uint32_t cmht                 : 8; /* [23:16] */
      __IO uint32_t cmdhizt              : 8; /* [31:24] */
    } bk3tmgmem_bit;
  };

  /**
  * @brief xmc bk3tmgatt register, offset:0x8C
  */
  union
  {
    __IO uint32_t bk3tmgatt;
    struct
    {
      __IO uint32_t amst                 : 8; /* [7:0] */
      __IO uint32_t amwt                 : 8; /* [15:8] */
      __IO uint32_t amht                 : 8; /* [23:16] */
      __IO uint32_t amdhizt              : 8; /* [31:24] */
    } bk3tmgatt_bit;
  };

  /**
  * @brief xmc reserved register, offset:0x90
  */
  __IO uint32_t reserved1;

  /**
  * @brief xmc bk3ecc register, offset:0x94
  */
  union
  {
    __IO uint32_t bk3ecc;
    struct
    {
      __IO uint32_t ecc                  : 32; /* [31:0] */
    } bk3ecc_bit;
  };
} xmc_bank3_type;

/**
  * @brief xmc bank4 registers
  */
typedef struct
{

  /**
    * @brief xmc bk4ctrl register, offset:0xA0
    */
  union
  {
    __IO uint32_t bk4ctrl;
    struct
    {
      __IO uint32_t reserved1            : 1; /* [0] */
      __IO uint32_t nwen                 : 1; /* [1] */
      __IO uint32_t en                   : 1; /* [2] */
      __IO uint32_t dev                  : 1; /* [3] */
      __IO uint32_t extmdbw              : 2; /* [5:4] */
      __IO uint32_t eccen                : 1; /* [6] */
      __IO uint32_t reserved2            : 2; /* [8:7] */
      __IO uint32_t tcr                  : 4; /* [12:9] */
      __IO uint32_t tar                  : 4; /* [16:13] */
      __IO uint32_t eccpgs               : 3; /* [19:17] */
      __IO uint32_t reserved3            : 12;/* [31:20] */
    } bk4ctrl_bit;
  };

  /**
    * @brief xmc bk4is register, offset:0xA4
    */
  union
  {
    __IO uint32_t bk4is;
    struct
    {
      __IO uint32_t res                  : 1; /* [0] */
      __IO uint32_t hls                  : 1; /* [1] */
      __IO uint32_t fes                  : 1; /* [2] */
      __IO uint32_t reien                : 1; /* [3] */
      __IO uint32_t hlien                : 1; /* [4] */
      __IO uint32_t feien                : 1; /* [5] */
      __IO uint32_t fifoe                : 1; /* [6] */
      __IO uint32_t reserved1            : 25;/* [31:7] */
    } bk4is_bit;
  };

  /**
  * @brief xmc bk4tmgmem register, offset:0xA8
  */
  union
  {
    __IO uint32_t bk4tmgmem;
    struct
    {
      __IO uint32_t cmst                 : 8; /* [7:0] */
      __IO uint32_t cmwt                 : 8; /* [15:8] */
      __IO uint32_t cmht                 : 8; /* [23:16] */
      __IO uint32_t cmdhizt              : 8; /* [31:24] */
    } bk4tmgmem_bit;
  };

  /**
  * @brief xmc bk4tmgatt register, offset:0xAC
  */
  union
  {
    __IO uint32_t bk4tmgatt;
    struct
    {
      __IO uint32_t amst                 : 8; /* [7:0] */
      __IO uint32_t amwt                 : 8; /* [15:8] */
      __IO uint32_t amht                 : 8; /* [23:16] */
      __IO uint32_t amdhizt              : 8; /* [31:24] */
    } bk4tmgatt_bit;
  };

  /**
  * @brief xmc bk4tmgio register, offset:0xB0
  */
  union
  {
    __IO uint32_t bk4tmgio;
    struct
    {
      __IO uint32_t iost                 : 8; /* [7:0] */
      __IO uint32_t iowt                 : 8; /* [15:8] */
      __IO uint32_t ioht                 : 8; /* [23:16] */
      __IO uint32_t iohizt               : 8; /* [31:24] */
    } bk4tmgio_bit;
  };
} xmc_bank4_type;

/**
  * @brief xmc sdram type
  */
typedef struct
{
  /**
    * @brief xmc sdram ctrl register, offset:0x140~0x144
    */
  union
  {
    __IO uint32_t ctrl[2];
    struct
    {
      __IO uint32_t ca                   : 2; /* [1:0] */
      __IO uint32_t ra                   : 2; /* [3:2] */
      __IO uint32_t db                   : 2; /* [5:4] */
      __IO uint32_t inbk                 : 1; /* [6] */
      __IO uint32_t cas                  : 2; /* [8:7] */
      __IO uint32_t wrp                  : 1; /* [9] */
      __IO uint32_t clkdiv               : 2; /* [11:10] */
      __IO uint32_t bstr                 : 1; /* [12] */
      __IO uint32_t rd                   : 2; /* [14:13] */
      __IO uint32_t reserved1            : 17;/* [31:15] */
    } ctrl_bit[2];
  };

  /**
    * @brief xmc sdram tm register, offset:0x148~0x14C
    */
  union
  {
    __IO uint32_t tm[2];
    struct
    {
      __IO uint32_t tmrd                 : 4; /* [3:0] */
      __IO uint32_t txsr                 : 4; /* [7:4] */
      __IO uint32_t tras                 : 4; /* [11:8] */
      __IO uint32_t trc                  : 4; /* [15:12] */
      __IO uint32_t twr                  : 4; /* [19:16] */
      __IO uint32_t trp                  : 4; /* [23:20] */
      __IO uint32_t trcd                 : 4; /* [27:24] */
      __IO uint32_t reserved1            : 4; /* [31:28] */
    } tm_bit[2];

